{
  "backend/main.mo": "Motoko canister managing pictures, messages, treats, and user profiles with admin/user authorization, CRUD operations, and storage mixins.",
  "feature_evidence.json": "Feature evidence report listing two win-popup UI features with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose across layout, sections, hooks, editors, and games.",
  "frontend/index.css": "Global Tailwind-based theme variables defining light/dark Valentine color palettes and base styling.",
  "frontend/index.html": "Basic HTML shell loading the React app root and main entry script.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile setup, owner tools, and rendering the Valentine layout with the GameSection.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button using Internet Identity to log in or out with status handling and query cache reset.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for creating a user profile with name input, mutation handling, and success/error toasts.",
  "frontend/src/components/game/CupidAimMiniGame.tsx": "Click-target mini-game where players hit a moving target 10 times to win, with reset logic and hit animations.",
  "frontend/src/components/game/HeartClickMiniGame.tsx": "Implements a timed heart-clicking game with moving targets where reaching a score of 15 triggers a win callback.",
  "frontend/src/components/game/LoveWordMiniGame.tsx": "Provides a word-unscrambling game that cycles through love-themed words and triggers a win after solving three.",
  "frontend/src/components/game/MatchPairsMiniGame.tsx": "Creates a memory matching game with icon pairs that shuffles cards and calls onWin when all pairs are matched.",
  "frontend/src/components/game/RewardsModal.tsx": "Displays a modal showing reward images and messages, with actions for replaying or returning to the menu.",
  "frontend/src/components/game/SweetSortMiniGame.tsx": "A color-sorting game where sweets are sorted into matching color bins, triggering a win when all are correctly placed.",
  "frontend/src/components/game/WinLoveMessagePopup.tsx": "Shows a temporary animated popup displaying a random love message when visible.",
  "frontend/src/components/game/WinPopups.tsx": "Displays celebratory pop-up images at random positions when activated and clears them after animation.",
  "frontend/src/components/owner/ImageUploadDialog.tsx": "Dialog for adding or editing pictures with image validation, preview, upload progress, and mutation handling.",
  "frontend/src/components/owner/MessagesEditor.tsx": "Interface for listing, adding, editing, deleting, and reordering messages using related mutations.",
  "frontend/src/components/owner/OwnerAccessDeniedDialog.tsx": "Alert dialog shown when a non-owner user attempts to access owner-only content.",
  "frontend/src/components/owner/OwnerEditorPanel.tsx": "Floating settings panel that shows owner-only editing tools or an access‑denied dialog based on admin status.",
  "frontend/src/components/owner/PicturesEditor.tsx": "UI for listing, sorting, deleting, and editing pictures, including an image upload dialog.",
  "frontend/src/components/owner/TreatsEditor.tsx": "Editor for creating, editing, deleting, and reordering sweet treats with form handling and mutations.",
  "frontend/src/components/valentine/SectionNav.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/valentine/sections/GameSection.tsx": "Main game hub managing mini‑game selection, win handling, rewards, and admin vs user content access.",
  "frontend/src/components/valentine/sections/IntroSection.tsx": "Landing section with a Valentine intro message and a button that scrolls to the photos section.",
  "frontend/src/components/valentine/sections/MessagesSection.tsx": "Displays unlocked or admin‑visible messages with loading, empty, and locked states.",
  "frontend/src/components/valentine/sections/PhotosSection.tsx": "Shows unlocked or admin‑visible photos, including a modal viewer and locked/empty states.",
  "frontend/src/components/valentine/sections/TreatsSection.tsx": "Renders unlocked or admin‑visible treats with emoji icons and locked placeholders.",
  "frontend/src/components/valentine/ValentineLayout.tsx": "Page layout with themed background and footer including a dynamic copyright and link.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to identity, updating dependent queries when it changes.",
  "frontend/src/hooks/useAuthz.ts": "Provides hooks for checking admin status and fetching the caller’s user profile via the actor.",
  "frontend/src/hooks/useGameProgress.ts": "Tracks completed mini‑games in sessionStorage and exposes helpers to query and update progress.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity, login, logout, and status helpers.",
  "frontend/src/hooks/useMessages.ts": "Defines React Query hooks for fetching, creating, updating, deleting, and reordering messages via the backend actor with toast notifications.",
  "frontend/src/hooks/usePictures.ts": "Provides hooks to manage pictures through the backend actor, including fetching, adding, updating, deleting, and reordering with query invalidation.",
  "frontend/src/hooks/useTreats.ts": "Implements hooks for CRUD and reorder operations on sweet treats using the backend actor and React Query.",
  "frontend/src/hooks/useUnlockedContent.ts": "Exposes hooks to fetch unlocked pictures, messages, and treats for the logged-in identity, sorted by position.",
  "frontend/src/hooks/useUnlocks.ts": "Provides a mutation hook to increment unlock counters and refresh unlocked content queries.",
  "frontend/src/index.css": "Tailwind-based global styles defining color themes, animations, and utility classes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the App component.",
  "frontend/src/utils/humanizeBackendError.ts": "Converts backend error messages into user-friendly text with special handling for common auth and network issues.",
  "frontend/src/utils/imageValidation.ts": "Validates image files by checking type and size against allowed JPG/PNG formats and a 5MB limit.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL params, persisting them in sessionStorage, and managing hash-based parameter cleanup.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, plugins, and container settings.",
  "project_state.json": "Stores the project’s metadata, feature definitions, and request tracking for a mini-game love‑message popup feature."
}