{
  "backend/main.mo": "Motoko canister managing user profiles plus admin‑only CRUD for pictures and messages with access‑control and blob‑storage mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented gameplay and UI changes with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files covering layout, game, hooks, editors, and utilities.",
  "frontend/index.css": "Tailwind base theme variables and dark mode variants defining the site's OKLCH color system and global styling.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Top-level React component wiring sections, authentication, profile setup, owner tools, and theme provider.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with query cache clearing and error handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for creating the owner profile with name input, validation, and save mutation.",
  "frontend/src/components/game/MatchPairsMiniGame.tsx": "A memory matching mini‑game that shuffles cards, tracks flips and matches, counts moves, and triggers onWin when all pairs are matched.",
  "frontend/src/components/game/RewardsModal.tsx": "A modal displaying three reward images and offering options to close or play the game again.",
  "frontend/src/components/game/WinPopups.tsx": "Generates temporary celebratory pop‑up images at random positions when activated, then clears them after an animation.",
  "frontend/src/components/owner/ImageUploadDialog.tsx": "Dialog for adding or editing pictures with validation, preview support, and upload progress tied to backend mutations.",
  "frontend/src/components/owner/MessagesEditor.tsx": "Interface to add, edit, delete, and reorder text messages with backend sync and inline editing UI.",
  "frontend/src/components/owner/OwnerEditorPanel.tsx": "Admin‑only panel that opens a sheet containing tabs for managing pictures and messages.",
  "frontend/src/components/owner/PicturesEditor.tsx": "Interface to add, delete, edit, reorder, and preview pictures, integrating with picture management hooks.",
  "frontend/src/components/valentine/SectionNav.tsx": "Renders a fixed navigation bar with buttons that scroll smoothly to Valentine sections and highlights the active section.",
  "frontend/src/components/valentine/sections/GameSection.tsx": "Implements a match‑pairs minigame with win handling, rewards, replay logic, and progress persistence.",
  "frontend/src/components/valentine/sections/IntroSection.tsx": "Displays the Valentine intro hero section with headline, description, and a button that scrolls to the photos section.",
  "frontend/src/components/valentine/sections/MessagesSection.tsx": "Fetches and displays ordered user messages with loading skeletons and empty‑state handling.",
  "frontend/src/components/valentine/sections/PhotosSection.tsx": "Fetches and displays images in a responsive grid with hover effects and a dialog for viewing details.",
  "frontend/src/components/valentine/ValentineLayout.tsx": "Provides the main Valentine page layout with gradient styling, section navigation, content wrapper, and footer.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAuthz.ts": "Exposes hooks for checking admin status and retrieving the caller’s user profile using the actor.",
  "frontend/src/hooks/useGameProgress.ts": "Tracks whether the user has won the game using sessionStorage with functions to mark or reset progress.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, logout, identity loading, and status management.",
  "frontend/src/hooks/useMessages.ts": "React Query hooks for fetching and mutating messages via the actor, with cache invalidation and toast notifications.",
  "frontend/src/hooks/usePictures.ts": "React Query hooks for CRUD and reordering of pictures using actor calls, including cache refresh and toasts.",
  "frontend/src/index.css": "Tailwind base styling and custom Valentine-themed color variables, utilities, and animations.",
  "frontend/src/main.tsx": "App entrypoint that sets up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/utils/imageValidation.ts": "Validates uploaded images by type and size, allowing only JPG/PNG up to 5MB.",
  "frontend/src/utils/urlParams.ts": "Helpers for retrieving, persisting, and clearing URL/session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and layout settings with plugins enabled.",
  "project_state.json": "Project metadata describing features, versions, and the overall Valentine-themed IC app architecture."
}