{
  "kind": "build_request",
  "title": "Show a sweet love message popup when the player wins a mini-game",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "When a player wins any mini-game, show a short “sweet love message” popup overlay in addition to the existing win celebration effects (and before/alongside the Rewards modal). The popup must appear for both first-time wins and repeat wins, and it must automatically dismiss after a short duration (e.g., 2–4 seconds) without requiring user interaction.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "when I win the game make a sweet love message also pop up"
        ]
      },
      "acceptanceCriteria": [
        "Winning any of the 5 mini-games triggers a visible overlay popup containing a sweet love message, in addition to the existing win UI/WinPopups behavior.",
        "The love-message popup appears on both first-time wins and already-completed wins.",
        "The love-message popup auto-dismisses after a short duration and does not block the existing flow to show the Rewards modal.",
        "The popup is visually readable on top of the game UI (appropriate contrast, spacing, and responsive sizing)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a reusable UI implementation for the win love-message popup (new component) and wire it into the win-handling flow in the game section so it resets correctly when the user plays again or returns to the menu.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "when I win the game make a sweet love message also pop up"
        ]
      },
      "acceptanceCriteria": [
        "A dedicated component exists for the love-message popup (instead of inline one-off markup) and is rendered from the game win flow.",
        "Clicking “Play Again” and “Back to Menu” clears/does not leave behind any visible love-message popup state.",
        "Triggering multiple wins across different games shows the popup each time (no stale message/state)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (compose existing shadcn components instead).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Do not add new backend APIs or persist love messages on-chain.",
    "Do not change the unlock/rewards logic or the existing WinPopups animation behavior beyond adding the additional message popup."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}