{
  "kind": "build_request",
  "title": "Fix owner content management so pictures and messages can be added",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix backend authorization/bootstrap so the intended owner account can successfully use admin-only endpoints to add/update/delete/reorder pictures and messages.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "not able to add pictures or messages"
        ]
      },
      "acceptanceCriteria": [
        "When logged in as the intended owner, backend calls to addPicture, updatePicture, deletePicture, reorderPictures succeed without trapping with \"Unauthorized\".",
        "When logged in as the intended owner, backend calls to addMessage, updateMessage, deleteMessage, reorderMessages succeed without trapping with \"Unauthorized\".",
        "The solution includes a clear, deterministic way to establish/administer the admin role after deployment (e.g., initial admin assignment and/or a safe bootstrap flow) without requiring manual state editing."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add explicit backend query endpoints for admins to fetch all pictures and all messages, and update the Owner Editor Panel data hooks to use these endpoints (instead of using unlocked-content queries intended for regular users).",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "not able to add pictures or messages"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes admin-only queries that return the full list of pictures and the full list of messages (independent of unlock counts).",
        "Owner editor screens (PicturesEditor and MessagesEditor) load existing items correctly for admins even when the admin has not unlocked any content.",
        "Non-admin callers cannot access the new admin-only queries (backend traps or rejects as appropriate)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve frontend UX for the owner editing flow so that if a user is authenticated but not an admin, the UI clearly indicates they do not have access to manage content, and mutation failures surface actionable error messages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "not able to add pictures or messages"
        ]
      },
      "acceptanceCriteria": [
        "If a logged-in user is not an admin, the app shows an English user-facing message indicating that content management is owner-only (instead of silently hiding all editing capabilities with no explanation).",
        "If add/update operations fail (e.g., due to authorization), the UI displays an English error message that helps the user understand what went wrong (not just a generic failure).",
        "No changes are made to immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useActor.ts, useInternetIdentity.ts(x), and frontend/src/components/ui)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Only create/update backend/migration.mo if a stable state schema change is required; otherwise keep migration as-is.",
    "Do not modify files under frontend immutablePaths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui."
  ],
  "nonGoals": [
    "Adding new mini-games or changing game win/unlock logic.",
    "Changing the locked/unlocked viewing experience for non-admin users beyond necessary error messaging.",
    "Adding third-party authentication providers (Internet Identity only)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}