{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Win love-message popup overlay for mini-game victories",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Show a short sweet love-message overlay popup on every mini-game win, auto-dismissing without blocking the existing win celebration and Rewards modal flow.",
      "acceptanceCriteria": [
        "Winning any of the 5 mini-games triggers a visible overlay popup containing a sweet love message, in addition to the existing win UI/WinPopups behavior.",
        "The love-message popup appears on both first-time wins and already-completed wins.",
        "The love-message popup auto-dismisses after a short duration and does not block the existing flow to show the Rewards modal.",
        "The popup is visually readable on top of the game UI (appropriate contrast, spacing, and responsive sizing)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/valentine/sections/GameSection.tsx",
          "operation": "modify",
          "description": "Trigger the new WinLoveMessagePopup whenever handleWin runs (for both first-time wins and repeat wins), ensure it shows alongside existing WinPopups, and ensure the auto-dismiss timing does not delay or block the existing Rewards modal timing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add a small, reusable animation/utility class for the love-message overlay (e.g., fade/scale in/out) to keep the popup readable over the game UI with appropriate contrast and responsive sizing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Create a reusable love-message win popup component and wire it into the game win flow with proper state reset for Play Again and Back to Menu.",
      "acceptanceCriteria": [
        "A dedicated component exists for the love-message popup (instead of inline one-off markup) and is rendered from the game win flow.",
        "Clicking “Play Again” and “Back to Menu” clears/does not leave behind any visible love-message popup state.",
        "Triggering multiple wins across different games shows the popup each time (no stale message/state)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/game/WinLoveMessagePopup.tsx",
          "operation": "create",
          "description": "Create a reusable WinLoveMessagePopup component that renders a fixed overlay message (English text) with optional randomized sweet-message selection, uses an internal timer (e.g., 2–4 seconds) to auto-dismiss via onDismiss, and uses pointer-events-none so it never requires/consumes user interaction."
        },
        {
          "path": "frontend/src/components/valentine/sections/GameSection.tsx",
          "operation": "modify",
          "description": "Wire WinLoveMessagePopup into the win-handling flow: add state for visibility/message key, render it with a stable key per win so consecutive wins always retrigger, and clear its state in startGame, handlePlayAgain, and handleBackToMenu to prevent stale UI."
        }
      ]
    }
  ]
}