{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Owner editor: use admin-only fetch + clearer non-admin UX and actionable errors",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Update owner editor data hooks to fetch full admin lists of pictures/messages (not unlocked-content queries).",
      "acceptanceCriteria": [
        "Owner editor screens (PicturesEditor and MessagesEditor) load existing items correctly for admins even when the admin has not unlocked any content."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePictures.ts",
          "operation": "modify",
          "description": "Switch admin editor fetching to use the backend capability that returns the full list (use getAllPictures instead of getUnlockedPictures) while keeping admin-gated query enablement. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useMessages.ts",
          "operation": "modify",
          "description": "Switch admin editor fetching to use the backend capability that returns the full list (use getAllMessages instead of getUnlockedMessages) while keeping admin-gated query enablement. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make non-admin access explicit in the UI and surface actionable error messages for owner mutations.",
      "acceptanceCriteria": [
        "If a logged-in user is not an admin, the app shows an English user-facing message indicating that content management is owner-only (instead of silently hiding all editing capabilities with no explanation).",
        "If add/update operations fail (e.g., due to authorization), the UI displays an English error message that helps the user understand what went wrong (not just a generic failure).",
        "No changes are made to immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useActor.ts, useInternetIdentity.ts(x), and frontend/src/components/ui)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/owner/OwnerEditorPanel.tsx",
          "operation": "modify",
          "description": "Adjust the panel gating so that authenticated non-admin users see an explicit owner-only access message (e.g., an access-denied dialog/notice) instead of returning null. Keep admin users’ current management UI unchanged. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/owner/OwnerAccessDeniedDialog.tsx",
          "operation": "create",
          "description": "Add a small owner-access explanation UI (English) for authenticated non-admin users (e.g., dialog or inline notice) that clarifies content management is owner-only and suggests logging in as the owner account. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/humanizeBackendError.ts",
          "operation": "create",
          "description": "Create a helper to convert common backend trap/errors (e.g., Unauthorized / role errors / actor not available) into actionable, user-friendly English messages suitable for toasts and inline form errors. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/usePictures.ts",
          "operation": "modify",
          "description": "Use the new error-humanizing helper in picture mutations (add/update/delete/reorder) so authorization failures and other common failures show actionable English messages in toasts. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useMessages.ts",
          "operation": "modify",
          "description": "Use the new error-humanizing helper in message mutations (add/update/delete/reorder) so authorization failures and other common failures show actionable English messages in toasts. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/owner/ImageUploadDialog.tsx",
          "operation": "modify",
          "description": "When add/update picture fails, display an actionable English error using the error-humanizing helper (instead of raw error.message) in the dialog’s inline error area. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}